app/views/authors/show.html.erb

<ul>
  <% @author.books.each do |book| %>
---
SELECT "books".* FROM "books" INNER JOIN "book_authors" ON "books"."id" = "book_authors"."book_id" WHERE "book_authors"."author_id" = $1  [["author_id", 350]]